CSI API ETABS v1
cCaseStaticNonlinearStaged.GetMaterialNonlinearity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMaterialNonlinearity(
	string Name,
	ref bool TimeDepMatProp
)
Function GetMaterialNonlinearity (
	Name As String,
	ByRef TimeDepMatProp As Boolean
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim TimeDepMatProp As Boolean
Dim returnValue As Integer
returnValue = instance.GetMaterialNonlinearity(Name,
	TimeDepMatProp)
int GetMaterialNonlinearity(
	String^ Name,
	bool% TimeDepMatProp
)
abstract GetMaterialNonlinearity :
        Name : string *
        TimeDepMatProp : bool byref -> int
Parameters
Name
Type: System.String
TimeDepMatProp
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace